## Terraform Plan for Staging Environment

**Environment**: Staging
**Branch**: develop
**Triggered by**: PR #58
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group_rule.alb_to_webserver_http will be created
  + resource "aws_security_group_rule" "alb_to_webserver_http" {
      + description              = "HTTP from ALB to webserver"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0c634b9674963274f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.alb_to_webserver_https will be created
  + resource "aws_security_group_rule" "alb_to_webserver_https" {
      + description              = "HTTPS from ALB to webserver"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0c634b9674963274f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.blue_asg.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages
            yum install -y python3 python3-pip git mariadb1011-client-utils jq
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python requests psutil
            
            # Create enhanced application files
            cat > app.py << 'EOF'
            from flask import Flask, jsonify, request
            import mysql.connector
            import os
            import psutil
            import time
            from datetime import datetime
            import requests
            
            app = Flask(__name__)
            
            # Database configuration
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': '${db_password}',
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            def check_database_connection():
                """Check if database connection is working"""
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True
                except Exception as e:
                    print(f"Database connection failed: {e}")
                    return False
            
            def check_application_readiness():
                """Check if application is ready to serve requests"""
                try:
                    # Just check if database is responding, don't check for specific data
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')  # Simple connectivity test
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True  # If we can connect and execute a query, we're ready
                except Exception as e:
                    print(f"Application readiness check failed: {e}")
                    return False
            
            def check_memory_usage():
                """Check if memory usage is within acceptable limits"""
                memory = psutil.virtual_memory()
                return memory.percent < 90  # Less than 90% memory usage
            
            def check_disk_space():
                """Check if disk space is sufficient"""
                disk = psutil.disk_usage('/')
                return disk.percent < 90  # Less than 90% disk usage
            
            def check_response_times():
                """Check if application response times are acceptable"""
                try:
                    start_time = time.time()
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    response_time = time.time() - start_time
                    return response_time < 2.0  # Less than 2 seconds
                except Exception:
                    return False
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify({
                        'contacts': contacts,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                """Enhanced health check endpoint"""
                try:
                    # Database connectivity check
                    db_status = check_database_connection()
                    
                    # Application readiness check
                    app_status = check_application_readiness()
                    
                    # System health checks
                    memory_status = check_memory_usage()
                    disk_status = check_disk_space()
                    response_status = check_response_times()
                    
                    # Overall health status
                    all_healthy = all([db_status, app_status, memory_status, disk_status, response_status])
                    
                    return jsonify({
                        'status': 'healthy' if all_healthy else 'unhealthy',
                        'checks': {
                            'database_connectivity': db_status,
                            'application_readiness': app_status,
                            'memory_usage': memory_status,
                            'disk_space': disk_status,
                            'response_times': response_status
                        },
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_healthy else 503
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/health/simple')
            def health_simple():
                """Simple health check for load balancer target groups"""
                try:
                    # Basic application check - just verify the app is running
                    # Don't check database or other services to keep it simple and fast
                    return jsonify({
                        'status': 'healthy',
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'message': 'Application is running'
                    }), 200
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 500
            
            @app.route('/deployment/validate')
            def deployment_validation():
                """Comprehensive validation for new deployments"""
                try:
                    checks = {
                        'database_connectivity': check_database_connection(),
                        'application_functionality': check_application_readiness(),
                        'memory_usage': check_memory_usage(),
                        'disk_space': check_disk_space(),
                        'response_times': check_response_times()
                    }
                    
                    all_passed = all(checks.values())
                    
                    return jsonify({
                        'deployment_ready': all_passed,
                        'checks': checks,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_passed else 503
                except Exception as e:
                    return jsonify({
                        'deployment_ready': False,
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/info')
            def info():
                """Instance information endpoint"""
                try:
                    memory = psutil.virtual_memory()
                    disk = psutil.disk_usage('/')
                    
                    return jsonify({
                        'deployment_color': '${deployment_color}',
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'system_info': {
                            'memory_usage_percent': memory.percent,
                            'disk_usage_percent': disk.percent,
                            'cpu_count': psutil.cpu_count(),
                            'uptime': time.time() - psutil.boot_time()
                        },
                        'timestamp': datetime.utcnow().isoformat()
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            Environment="INSTANCE_ID=$(curl -s http://169.254.169.254/latest/meta-data/instance-id)"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            RestartSec=10
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
            
            # Wait for the application to start up
            echo "Waiting for application to start up..." >> /var/log/webapp-deployment.log
            sleep 30
            
            # Verify the application is running
            for i in {1..10}; do
                if curl -f http://localhost:8080/health/simple > /dev/null 2>&1; then
                    echo "Application is running and responding to health checks" >> /var/log/webapp-deployment.log
                    break
                else
                    echo "Attempt $i: Application not yet ready, waiting..." >> /var/log/webapp-deployment.log
                    sleep 10
                fi
            done
            
            # Create a simple health check script
            cat > /usr/local/bin/health-check.sh << 'EOF'
            #!/bin/bash
            curl -f http://localhost:8080/health > /dev/null 2>&1
            exit $?
            EOF
            
            chmod +x /usr/local/bin/health-check.sh
            
            # Log deployment information
            echo "Deployment completed for ${deployment_color} environment at $(date)" >> /var/log/webapp-deployment.log
            echo "Instance ID: $(curl -s http://169.254.169.254/latest/meta-data/instance-id)" >> /var/log/webapp-deployment.log
            echo "Deployment Color: ${deployment_color}" >> /var/log/webapp-deployment.log
            echo "Application startup sequence completed" >> /var/log/webapp-deployment.log
        EOT
      + vars     = {
          + "db_host"          = (known after apply)
          + "db_name"          = "tfplayground"
          + "db_password"      = (sensitive value)
          + "db_user"          = (sensitive value)
          + "deployment_color" = "blue"
        }
    }

  # module.blue_asg.aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "staging-blue-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:us-east-2:123324351829:targetgroup/staging-blue-tg/0390b6317045951d",
        ]
      + vpc_zone_identifier              = [
          + "subnet-0331c50e7a1391dde",
          + "subnet-0c28be712f0aba598",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "blue"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "staging"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "staging-blue-asg"
        }

      + traffic_source (known after apply)
    }

  # module.blue_asg.aws_launch_template.asg will be created
  + resource "aws_launch_template" "asg" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-06c8f2ec674c67112"
      + instance_type   = "t3.micro"
      + key_name        = "staging-blue-key"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "staging-blue-lt"
      + tags            = {
          + "Name" = "staging-blue-launch-template"
        }
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-launch-template"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "staging-blue-asg-profile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "DeploymentColor" = "blue"
              + "Environment"     = "staging"
              + "Name"            = "staging-blue-instance"
            }
        }
    }

  # module.blue_asg.aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Security group for blue Auto Scaling Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow HTTP traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "staging-blue-asg-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-blue-asg-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-asg-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = "vpc-0feec7fd035a06fd3"
    }

  # module.database.aws_db_instance.database will be created
  + resource "aws_db_instance" "database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "tfplayground"
      + db_subnet_group_name                  = "staging-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Name" = "staging-database"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + timezone                              = (known after apply)
      + username                              = "tfplayground_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow MySQL access from web server security group"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow MySQL access from web server security group"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "staging-database-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-database-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = "vpc-0feec7fd035a06fd3"
    }

  # module.green_asg.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages
            yum install -y python3 python3-pip git mariadb1011-client-utils jq
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python requests psutil
            
            # Create enhanced application files
            cat > app.py << 'EOF'
            from flask import Flask, jsonify, request
            import mysql.connector
            import os
            import psutil
            import time
            from datetime import datetime
            import requests
            
            app = Flask(__name__)
            
            # Database configuration
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': '${db_password}',
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            def check_database_connection():
                """Check if database connection is working"""
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True
                except Exception as e:
                    print(f"Database connection failed: {e}")
                    return False
            
            def check_application_readiness():
                """Check if application is ready to serve requests"""
                try:
                    # Just check if database is responding, don't check for specific data
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')  # Simple connectivity test
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True  # If we can connect and execute a query, we're ready
                except Exception as e:
                    print(f"Application readiness check failed: {e}")
                    return False
            
            def check_memory_usage():
                """Check if memory usage is within acceptable limits"""
                memory = psutil.virtual_memory()
                return memory.percent < 90  # Less than 90% memory usage
            
            def check_disk_space():
                """Check if disk space is sufficient"""
                disk = psutil.disk_usage('/')
                return disk.percent < 90  # Less than 90% disk usage
            
            def check_response_times():
                """Check if application response times are acceptable"""
                try:
                    start_time = time.time()
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    response_time = time.time() - start_time
                    return response_time < 2.0  # Less than 2 seconds
                except Exception:
                    return False
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify({
                        'contacts': contacts,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                """Enhanced health check endpoint"""
                try:
                    # Database connectivity check
                    db_status = check_database_connection()
                    
                    # Application readiness check
                    app_status = check_application_readiness()
                    
                    # System health checks
                    memory_status = check_memory_usage()
                    disk_status = check_disk_space()
                    response_status = check_response_times()
                    
                    # Overall health status
                    all_healthy = all([db_status, app_status, memory_status, disk_status, response_status])
                    
                    return jsonify({
                        'status': 'healthy' if all_healthy else 'unhealthy',
                        'checks': {
                            'database_connectivity': db_status,
                            'application_readiness': app_status,
                            'memory_usage': memory_status,
                            'disk_space': disk_status,
                            'response_times': response_status
                        },
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_healthy else 503
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/health/simple')
            def health_simple():
                """Simple health check for load balancer target groups"""
                try:
                    # Basic application check - just verify the app is running
                    # Don't check database or other services to keep it simple and fast
                    return jsonify({
                        'status': 'healthy',
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'message': 'Application is running'
                    }), 200
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 500
            
            @app.route('/deployment/validate')
            def deployment_validation():
                """Comprehensive validation for new deployments"""
                try:
                    checks = {
                        'database_connectivity': check_database_connection(),
                        'application_functionality': check_application_readiness(),
                        'memory_usage': check_memory_usage(),
                        'disk_space': check_disk_space(),
                        'response_times': check_response_times()
                    }
                    
                    all_passed = all(checks.values())
                    
                    return jsonify({
                        'deployment_ready': all_passed,
                        'checks': checks,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_passed else 503
                except Exception as e:
                    return jsonify({
                        'deployment_ready': False,
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/info')
            def info():
                """Instance information endpoint"""
                try:
                    memory = psutil.virtual_memory()
                    disk = psutil.disk_usage('/')
                    
                    return jsonify({
                        'deployment_color': '${deployment_color}',
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'system_info': {
                            'memory_usage_percent': memory.percent,
                            'disk_usage_percent': disk.percent,
                            'cpu_count': psutil.cpu_count(),
                            'uptime': time.time() - psutil.boot_time()
                        },
                        'timestamp': datetime.utcnow().isoformat()
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            Environment="INSTANCE_ID=$(curl -s http://169.254.169.254/latest/meta-data/instance-id)"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            RestartSec=10
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
            
            # Wait for the application to start up
            echo "Waiting for application to start up..." >> /var/log/webapp-deployment.log
            sleep 30
            
            # Verify the application is running
            for i in {1..10}; do
                if curl -f http://localhost:8080/health/simple > /dev/null 2>&1; then
                    echo "Application is running and responding to health checks" >> /var/log/webapp-deployment.log
                    break
                else
                    echo "Attempt $i: Application not yet ready, waiting..." >> /var/log/webapp-deployment.log
                    sleep 10
                fi
            done
            
            # Create a simple health check script
            cat > /usr/local/bin/health-check.sh << 'EOF'
            #!/bin/bash
            curl -f http://localhost:8080/health > /dev/null 2>&1
            exit $?
            EOF
            
            chmod +x /usr/local/bin/health-check.sh
            
            # Log deployment information
            echo "Deployment completed for ${deployment_color} environment at $(date)" >> /var/log/webapp-deployment.log
            echo "Instance ID: $(curl -s http://169.254.169.254/latest/meta-data/instance-id)" >> /var/log/webapp-deployment.log
            echo "Deployment Color: ${deployment_color}" >> /var/log/webapp-deployment.log
            echo "Application startup sequence completed" >> /var/log/webapp-deployment.log
        EOT
      + vars     = {
          + "db_host"          = (known after apply)
          + "db_name"          = "tfplayground"
          + "db_password"      = (sensitive value)
          + "db_user"          = (sensitive value)
          + "deployment_color" = "green"
        }
    }

  # module.green_asg.aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "staging-green-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:us-east-2:123324351829:targetgroup/staging-green-tg/600b15c1b0090834",
        ]
      + vpc_zone_identifier              = [
          + "subnet-0331c50e7a1391dde",
          + "subnet-0c28be712f0aba598",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "green"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "staging"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "staging-green-asg"
        }

      + traffic_source (known after apply)
    }

  # module.green_asg.aws_launch_template.asg will be created
  + resource "aws_launch_template" "asg" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-06c8f2ec674c67112"
      + instance_type   = "t3.micro"
      + key_name        = "staging-green-key"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "staging-green-lt"
      + tags            = {
          + "Name" = "staging-green-launch-template"
        }
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-launch-template"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "staging-green-asg-profile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "DeploymentColor" = "green"
              + "Environment"     = "staging"
              + "Name"            = "staging-green-instance"
            }
        }
    }

  # module.green_asg.aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Security group for green Auto Scaling Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow HTTP traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "staging-green-asg-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-green-asg-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-asg-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = "vpc-0feec7fd035a06fd3"
    }

  # module.loadbalancer.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "staging-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0331c50e7a1391dde",
          + "subnet-0c28be712f0aba598",
        ]
      + tags                                                         = {
          + "Name" = "staging-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.loadbalancer.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name" = "staging-alb-http-listener"
        }
      + tags_all                                                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-http-listener"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:123324351829:targetgroup/staging-blue-tg/0390b6317045951d"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.loadbalancer.aws_lb_listener_rule.blue will be created
  + resource "aws_lb_listener_rule" "blue" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Name" = "staging-blue-rule"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-rule"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:123324351829:targetgroup/staging-blue-tg/0390b6317045951d"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.green will be created
  + resource "aws_lb_listener_rule" "green" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 200
      + tags         = {
          + "Name" = "staging-green-rule"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-rule"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:123324351829:targetgroup/staging-green-tg/600b15c1b0090834"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/green*",
                  + "/green/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "staging-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = "vpc-0feec7fd035a06fd3"
    }

  # module.networking.aws_security_group.alb will be destroyed
  # (because aws_security_group.alb is not in configuration)
  - resource "aws_security_group" "alb" {
      - arn                    = "arn:aws:ec2:us-east-2:123324351829:security-group/sg-0065c41a2131d7190" -> null
      - description            = "Security group for Application Load Balancer" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-0065c41a2131d7190" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP from anywhere"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS from anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "staging-alb-sg" -> null
      - owner_id               = "123324351829" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "staging"
          - "ManagedBy"   = "terraform"
          - "Name"        = "staging-alb-sg"
          - "Project"     = "tf-playground"
        } -> null
      - tags_all               = {
          - "Environment" = "staging"
          - "ManagedBy"   = "terraform"
          - "Name"        = "staging-alb-sg"
          - "Pipeline"    = "gitflow-cicd"
          - "Project"     = "tf-playground"
        } -> null
      - vpc_id                 = "vpc-0feec7fd035a06fd3" -> null
        # (1 unchanged attribute hidden)
    }

  # module.networking.aws_security_group.database will be updated in-place
  ~ resource "aws_security_group" "database" {
        id                     = "sg-049fb8a791eeba481"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "MySQL from web servers"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "staging-database-sg"
        tags                   = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-database-sg"
            "Project"     = "tf-playground"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 15 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + alb_dns_name              = (known after apply)
  + alb_url                   = (known after apply)
  + alb_zone_id               = (known after apply)
  + application_url           = (known after apply)
  + blue_asg_id               = (known after apply)
  + database_endpoint         = (known after apply)
  + database_port             = (known after apply)
  + deployment_validation_url = (known after apply)
  + environment_summary       = {
      + alb_dns_name      = (known after apply)
      + application_url   = (known after apply)
      + blue_asg_name     = "staging-blue-asg"
      + database_endpoint = (known after apply)
      + environment       = "staging"
      + green_asg_name    = "staging-green-asg"
      + region            = "us-east-2"
      + vpc_id            = "vpc-0feec7fd035a06fd3"
    }
  + green_asg_id              = (known after apply)
  + health_check_url          = (known after apply)
  + http_listener_arn         = (known after apply)

  ```
  
  </details>